tap "amazon/amazon", "ssh://git.amazon.com/pkg/HomebrewAmazon"
tap "d12frosted/emacs-plus"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "incidentist/nyxt"
brew "automake"
brew "bash"
brew "bat"
brew "ghc"
brew "cabal-install"
brew "python@3.9"
brew "glib"
brew "pkg-config"
brew "cmake"
brew "coreutils"
brew "cowsay"
brew "exa"
brew "exercism"
brew "fd"
brew "fzf"
brew "gawk"
brew "gdk-pixbuf"
brew "git"
brew "git-remote-codecommit"
brew "gnutls"
brew "gobject-introspection"
brew "gradle"
brew "harfbuzz"
brew "haskell-stack"
brew "htop"
brew "python@3.8"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "pango"
brew "librsvg"
brew "luajit"
brew "luarocks"
brew "neovim"
brew "nghttp2"
brew "qt"
brew "poppler"
brew "ranger"
brew "ripgrep"
brew "rust"
brew "shellcheck"
brew "terraform"
brew "tmux"
brew "tree"
brew "wget"
brew "amazon/amazon/ninja-dev-sync"
brew "d12frosted/emacs-plus/emacs-plus@27"
brew "hashicorp/tap/terraform-ls"
cask "dcv-viewer"
cask "font-ubuntu-mono-nerd-font"
cask "kitty"
cask "mactex"
