tap "nikitabobko/tap"
brew "automake"
brew "openssl@3"
brew "awscli"
brew "bash"
brew "glib"
brew "cmake"
brew "coreutils"
brew "coursier"
brew "dive"
brew "entr"
brew "eza"
brew "fd"
brew "fzf"
brew "gawk"
brew "gdk-pixbuf"
brew "git"
brew "git-delta"
brew "gnutls"
brew "gnupg"
brew "gpgme"
brew "pango"
brew "librsvg"
brew "grip"
brew "libheif"
brew "imagemagick"
brew "inlyne"
brew "jq"
brew "kcat"
brew "kind"
brew "kubernetes-cli"
brew "lazydocker"
brew "lazygit"
brew "libmagic"
brew "llmfit"
brew "llvm"
brew "mise"
brew "neovim"
brew "pkgconf"
brew "plantuml"
brew "pnpm"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "stow"
brew "stylua"
brew "tmux"
brew "tree"
brew "uv"
brew "yq"
cask "nikitabobko/tap/aerospace"
cask "bitwarden"
cask "docker-desktop"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-powerline-symbols"
cask "ghostty"
cask "karabiner-elements", args: { appdir: "/Applications" }
cask "obsidian"
cask "qview"
cask "slack"
cask "spotify", args: { appdir: "/Applications" }
cask "vesktop"
cask "visual-studio-code", args: { appdir: "/Applications" }
