tap "felixkratz/formulae"
tap "nikitabobko/tap"
tap "wez/wezterm"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Core application library for C
brew "glib"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Tool for exploring each layer in a docker image
brew "dive"
# Run arbitrary commands when files change
brew "entr"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# GitHub Markdown previewer
brew "grip"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Implementation of the file(1) command
brew "libmagic"
# Find what models run on your hardware
brew "llmfit"
# Next-gen compiler infrastructure
brew "llvm"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Draw UML diagrams
brew "plantuml"
# Fast, disk space efficient package manager
brew "pnpm"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Smart session manager for the terminal
brew "sesh"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Desktop password and login vault
cask "bitwarden"
# Utility that prevents the system from going to sleep
cask "caffeine"
# Screenshot software with built-in annotation tools
cask "flameshot"
# Privacy-focused Firefox-based browser
cask "floorp"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-powerline-symbols"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Speech to text application
cask "handy"
# HTTP and GraphQL Client
cask "insomnia"
# Keyboard customiser
cask "karabiner-elements", args: { appdir: "/Applications" }
# Password manager app
cask "keepassxc"
# Free and open-source painting and sketching program
cask "krita"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Simple Gtk# Paint Program
cask "pinta"
# Image viewer
cask "qview"
# PDF viewer designed for reading research papers and technical books
cask "sioyek"
# Custom Discord App
cask "vesktop"
# Open-source code editor
cask "visual-studio-code", args: { appdir: "/Applications" }
